import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class Alfsl2b extends StatefulWidget {

  const Alfsl2b({Key? key}) : super(key: key);


  @override

  State<Alfsl2b> createState() => _Alfsl2bState();
}

class _Alfsl2bState extends State<Alfsl2b> {
  final ScrollController controller = ScrollController();

  bool clr = false;
  double width = 19 ;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor:  (clr == true)?  Colors.black :Colors.white,
      appBar: AppBar(

        title: Text("شراكة في طور التكوين",
          style: GoogleFonts.getFont('Almarai'),

        ),

      ),
      body:  SingleChildScrollView(

        child: Column(

          children: [

            Stack(

              children:[ Container(

                child:  Image(image: AssetImage("images/fady1.png"),

                ),
              ),
                Container(
                  margin: EdgeInsets.only(right: 50,top: 40),
                  child:  Text("شراكة في طور التكوين",
                    style: TextStyle(
                        color: Colors.black, fontSize: 20),),
                ),




                Container(

                  margin: EdgeInsets.only(top: 200, bottom: 30),
                  padding: EdgeInsets.symmetric( horizontal: 20),
                  child: Text(
                    """  
 في صباح اليوم التالي أخبرت صديقي الحميمة مايك بمقاله والدي، وأفضل ما يمكننا قوله. هو أنني ومايك كنا تلميذين الفقيرين الوحيدين في هذه المدرسة. لقد شابهني مايك في التحاقه بهذه المدرسة، كان لمسة حانية من لمسات القدر. اذ خصص شخص ما هذه المدرسة لكل من كان يسكن في المنطقة فجمعنا مع تلاميذ الميسورين، ولم نكن فقراء حق لكننا شعرنا بهذا إذ كان الأولاد الآخرون يحوزون قفازات جديدة للعبة البيسبول ودراجات جديدة وكل شيء جديد. لقد وفر لي والدي وأمي الأساسيات كالغذاء والمأوى والملابس، لكن المسألة لم تكن هي ذاك، إذ اعتاد والدي أن يقول إذا رأيت شيئا فعليك العمل لتحصل عليه. ولقد أردنا أشياء في ما لم يتوفر الكثير من العمل للأولاد في التاسعة من عمرهم. سألني مايك فماذا نفعل إذن لجني المال؟ فقلت لا أدري، ولكن أترغب في أن تكون شريكي؟ وافق مايك، وهكذا في صبيحة يوم سبت هذا أضحى معك شريك العمل الأول واتفقنا طوال الصباح نخلق أفكارا عن طريقة جني المال، وأتى بنا الحديث في مناسبات عن ذكر الفتية الهادئين الذين يتمتعون بمنزل مثل جيمي على الشاطئ. ولقد سبب لنا هذا القليل من الأذى، وإن كان هذا الأذى نافعا. إذا ألهمنا من الاستمرار في التفكير في وسيلة لجني المال. وأخيرا، في ظهيرة هذا اليوم، التمعت بارقة ضوء في رأسينا. كانت فكرة استقاها مايك من كتاب العلوم الذي قرأه وتصافحنا بحماسة. فلقد أضحت  شراكتنا الآن شيئا عمليا. ولأسابيع عديدة تالية، ذهبت أنا ومايك نجول في الحي ونقرع الأبواب، ونسأل الجيران أن يبقوا على عبوات غسول الفم لأجلنا. فوافق أغلب الكبار وعلى وجوههم نظرة مرتبكة، وابتسامة ولقد سألنا بعضهم ماذا تفعلان، وهو ما رددنا عليه بقولنا؟ ليس بوسعنا البوح لك. إنه سر من أسرار العمل. لقد ازداد الضغط النفسي على والدتي بمرور الأسابيع إذا انتقينا موقعا بجوار الغسالة الخاصة بها لتخزين المواد الخام الخاصة بنا. وفي صندوق من الورق البني المقوى والذي احتوى ذات مرة على عبوات الكاتشب. أخذ مخزوننا من عبوات غسول الفم الفارغة في التنامي. وأخيرا وطئت  قدم أمي هذا المكان. إذا استبانت  صورة عبوات غسول الفم المتراكمة في فوضى وسألتنا ماذا تفعلان أيها الولدان ولا أبغي سماعا كما تقولان ثانية. إنها أسرار عمل عليكم أن تفعل شيئا إزاء هذه الفوضى وإلا فسألقي بها خارجها. توسلت  أنا ومايك لأمي مفسرين بأنه سريعا ما ستتوافر عندنا الكميات الكافية وعندها سنشرع في الإنتاج. وقد أعلمنا هذه أننا في انتظار زوجين من جيراننا لينتهي من استخدام عبوة غسول الفم الخاصة بهما مما يخولنا استعمالها فأمهلتنا أمي مهلة أسبوع. ولقد اقترب موعد بدء الإنتاج وتزايدت الضغوط علينا. وتعرضت شراكة الأولى بالفعل للتهديد بإشعال طرد من المكان الذي اخترناه كمستودع من قبل أمي  فصارت مهمته مايك إعلام الجيران بسرعة استهلاك عبوات غسول الفم لديهم. مخبرا إياهم بأن طبيب الأسنان يريد منهم زيادة معدل تنظيفهم لأسنانهم. وشرعت أنا في تجميع خط الإنتاج. وذات يوم يصطحب والدي صديقه لكي يريه ولدين في التاسعة من عمرهما وهما يقيمان خط إنتاج على مدرج السيارات ويعملان على قدم وساق. كان هناك مسحوق أبيض متناثر في كل مكان، كما كانت هناك عبوات ألبان صغيرة الحجم فوق الطاولة الطويلة أتينا بها من المدرسة وطاولة شواء خاصة بعائلتنا يتلظى فوقها فحم متوهج بحرارة شديدة. ولقد خطى والدي بحذر، واضطر لصف السيارة أدنى المدرج السيارات، وفيما اقترب هو وصديقه نظر إلى قدر حديدية تعتلي قطع الفحم بينما تأخذ عبوات غسول الأسنان الفارغة في الذوبان.
في تلك الأيام لم يكن غسول الفم يعبأ في عبوات بلاستيكية، بل كانت تلك العبوات  تصنع من مادة معدنية وهي الرصاص. وفوق احتراق الرسم الذي يغطي تلك العبوات، كنا نلقي بالعبوات في القدر الحديدية لتذوب حتى تضحى سائلا. وباستخدام مقبض القدر الحديدية، كنا نصب الرصاصة المذابة من فتحة صغيرة في أعلى علب اللبن الكرتونية.
 
كانت على اللبن الكرتونية مليئة بالصمغ الصائد للحشرات، أما المسحوق الأبيض المتناثر في كل مكان فكان عبارة عن الصمغ اللاصق  قبل مزجه بالماء. وفي خضم عجلتي اصطدمت بحقيبة المسحوق الأبيض  الاصق فثقبتها .  فبدأت المنطقة بأكملها كما لو ضربتها عاصفة ثلجية. ولقد كانت العبوات الكرتونية هي القالب الخارجي لقوالب اللاصق الحشري. شاهدنا أبي وصديقه ونحن نصب الرصاص المذاب بعناية عبر الفتحة الصغيرة بأعلى مكعب اللاصق الحشري فقال والدي احذر. فأومأت  دون تحريك رأسي لأنظر إليه، وأخيرا وفور انتهاء عملية الصب وضعت القدرة المعدنية على الأرض وتبسمت في وجه أبي. فسألنا وعلى وجهه ابتسامة حذرة، ما الذي تفعلانه أيها الولدان؟ فقلت إننا نقوم بما أخبرتني به. إن سائرين إلى الثراء، ابتسم مايك ابتسامة عريضة قائلاً: نعم، فنحن شركان وهو يهز رأسه وسألني أبي: وما الذي في قوالب المسحوق اللاصقة تلك؟ فقلت له انظر. ينبغي أن تكون تلك خلطة متقنة  و بمطرقة صغيرة طرقت برفق العلامة التي قسمت المكعبة عند منتصفه. وبحذر قمت بسحب النصف الأعلى من القالب اللاصق فيما سال معدن النيكل خارجا قال أبي يا إلهي إنك تخرج النيكل من معدن الرصاص. فأجاب مايك قائلا : هذا صواب، فنحن نقوم بما قلت لنا أن نقوم به، ونحن نجني المال التفت صديق والدي وانفجر ضاحكا وتبسم والدي وهز رأسه. تبي فبجواري موقد وصندوق مليء بعبوات غسول الفم الفارغة. وقف ولدان صغيران وقد غطاهما غبار أبيض وتعلو وجهيهم ابتسامة عريضة . فطلب منا وضع كل شيء جانبا وجلس معنا في واجهة المنزل، وأوضح مبتسما أن الأمر قد يكون غير قانوني. وانهارت أحلامنا وسائل مايك بصوت مرتعش. هل تعني أننا لا نستطيع القيام بمثل هذا العمل ثانية؟  فقال   صديق والدي دعهما يعملان فقد يظهران  موهبة وحملق فيه والدي غاضبة ثم قال بدماثة نعم هذا الأمر غير قانوني لكنكم أيها الولدان قد أظهرتما موهبة عظيمة وفكرا أصيلا. امضيا  قدما وأنا جد فخور  بكما. جلسنا أنا ومايك صامتين محبطين لما يقرب من ال20 دقيقة قبل أن نشرع في تنظيف الفوضى التي خلفناها. لقد انتهى مشروعنا يوم أن بدأ. وفيما أخذت أزيل المسحوق المتناثر، نظرت لمايك وقلت أحسب أن جيمي وأقرانه صائبون، فنحن فقيران كان أبي بسبيل للمغادرة. لحظة تلفظت بهذا فقال أيها الولدان ستصيران فقيرين فقط إن استسلمتما  فالشيء الأهم  أنكما قمتما بشيء. فأغلب الناس لا يفعلون سوى الحديث والحلم بالثراء، ولكنكما قمتم بشيء وإنني لأفخر بكم مع وسوف أقولها مجددا امضي و لا تتوقفا. قبعت أنا ومايك هناك في صمت. كانت كلمات طيبة، لكننا ما زلنا لا ندري ماذا نفعل. فسألته أبي لماذا لم تصبح ثريا حتى الآن؟ فأجابني. ذاك لأنني اخترت أن أسلك مجال التدريس، والمعلمون لا يفكرون حقيقة في الثراء إذن حب وتدريس وحسب. وأتمنى لو كنت أستطيع تقديم العون لك، ولكنني لا أدري كيفية جني المال فاستدرت أنا وميك و أكملنا تنظيف المكان .
ولكن أبي استدرك  قالا بل أنا أعلم فإن رغبت ما أيها الولدان في جني المال فلا تسألاني بل تحدث إلى أبيك يا مايك. فتساءل مايك وعلى وجهه أمارات الدهشة. أبي أنا. فقال والدي وعلى وجهه ابتسامة. نعم أبوك فأنا وأبوك لدينا نفس المستشار المصرفي لكنه يتحدث بحماسة بالغة عن أبيك، فلقد أخبرني مرات عدة عن تألق والدك إذا تعلق الأمر بجني المال. فسأله مايك ثانية مستنكرة والدي أنا فلم لم نمتلك إذا سيارة جميلة ولا منزلا جميلا كأصدقاء الدراسة الميسورين. فأجابه والدي لسيارة الجميلة ولا المنزل الجميل يعني ان بالضرورة كونك ثرياً أو كونك تجيد كسب المال فوالد جميع يعمل لصالح شركة السكر ولا يختلف في كثير عني إذ يعمل في شركة فيما أعمل أنا بالحكومة. ولقد اشترت له الشركة السيارة، لكن الشركة السكري تواجه حاليا مشاكل مالية وسرعان ما قد يواجه والد جيمي مشاكل عديدة. أما والدك يا مايك فهو مختلف، إذ يبدو كمن يشيد المملكة، وإنني لا أتوقع أن يصير رجلا غاية في الثراء في غضون سنوات قلائل. بهذا استعدنا أنا ومايك حماستنا ثانية وبعزم جديد شرعنا في تنظيف الفوضى التي سببها عملونا الأول والذي قضى نحبه وفيما كنا نقوم بالتنظيف وضعنا خططا عن كيفية ومتى نتحدث مع والد مايك. وكانت المشكلة هي أن والد مايك يعمل لساعات طويلة ولا يعود إلى منزله إلا متأخرا في أغلب الأحيان، فولده يمتلك مستودعا خاص و شركة إنشاءات وسلسلة من المتاجر وثلاثة مطاعم. وكانت المطاعم هي ما يبقيه خارج الوقت متأخر. أدرك مايك الحافلة بعد انتهائها من عملية التنظيف، وكان في طريقه لوالديه أثناء عودته تلك الليلة للمنزل ليسأله كيف يعلمنا سبل تحقيق الثراء. وقد وعدني مايك بالاتصال فور حديثه لوالده حتى وإن جار ذلك في وقت متأخر. دقة جرس الهاتف في الثامنة والنصف وأجبت قائلا حسنا السبت المقبل ووضعت سماعة الهاتف. لقد وافق والد مايك على لقاء ومايك، وفي السابعة والنصف من صباح السبت، أدركت الحافلة المتوجهة للشاطيء الفقير من البلدة. 

 """ ,
                    style: TextStyle(
                      fontSize: width,
                      height: 2,
                      color: (clr != false)?  Colors.white :Colors.black,

                    ),



                    textAlign: TextAlign.justify,
                  ),
                ),
                Row(

                  mainAxisAlignment: MainAxisAlignment.spaceAround ,
                  children: [

                    InkWell(

                      child: Container(
                        margin: EdgeInsets.only(top: 120,right: 20),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.cyan,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),
                        child: Icon(
                          Icons.add,
                          color: Colors.black,

                        ),

                      ),
                      onTap: (){
                        width++;
                        setState(() {

                        });
                      },


                    ),

                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 20),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.cyan,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),
                        child: Icon(
                          Icons.remove,
                          color: Colors.black,

                        ),

                      ),
                      onTap: (){
                        width--;
                        setState(() {

                        });
                      },


                    ),

                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 10),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.black,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),

                      ),
                      onTap: (){
                        clr = true;
                        setState(() {

                        });


                      },


                    ),
                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 10),
                        height: 40,
                        width: 40,
                        decoration:
                        BoxDecoration(
                          color: Colors.white,

                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],

                        ),



                      ),
                      onTap: (){
                        clr = false;
                        setState(() {

                        });


                      },


                    ),
                  ],
                ),
              ],
            ),



          ],
        ),
      ),
    );
  }
}
