import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class Alfsl2K extends StatefulWidget {

  const Alfsl2K({Key? key}) : super(key: key);


  @override

  State<Alfsl2K> createState() => _Alfsl2KState();
}

class _Alfsl2KState extends State<Alfsl2K> {
  final ScrollController controller = ScrollController();

  bool clr = false;
  double width = 19 ;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor:  (clr == true)?  Colors.black :Colors.white,
      appBar: AppBar(

        title: Text(" تلافي الوقوع في أكبر شراك الحياة",
          style: GoogleFonts.getFont('Almarai'),

        ),

      ),
      body:  SingleChildScrollView(

        child: Column(

          children: [

            Stack(

              children:[ Container(

                child:  Image(image: AssetImage("images/fady1.png"),

                ),
              ),
                Container(
                  margin: EdgeInsets.only(right: 50,top: 40),
                  child:  Text(" تلافي الوقوع في أكبر شراك الحياة",
                    style: TextStyle(
                        color: Colors.black, fontSize: 20),),
                ),




                Container(

                  margin: EdgeInsets.only(top: 200, bottom: 30),
                  padding: EdgeInsets.symmetric( horizontal: 20),
                  child: Text(
                    """  

 حسنا، خير لكما أيها الولدان. أن تشرعا في التفكير فقد استهللتما أحد أعظم دروس الحياة. فإذا وعيتم الدرس فستستمتعان بحياة تزخر بالحرية والأمان. أما إن لم تعياه. فسوف ينتهي بكما الحال كالسيدة مارتن ومثل هؤلاء الذين يلعبون الكرة في هذه الحديقة، إذ يكدون في عملهم لقاء مقابله زهيد  وينساقون وراء وهم الأمان الوظيفي، متطلعين لإجازة من ثلاثة أسابيع كل عام. ولمعاش هزيل بعد 45 عاما من الكدح. فإذا كان في هذا ما يثيركما فسأرفع ما تتقاضون، هل 25 سنتا لقاء الساعة؟ فتساءلت لكن هؤلاء الناس طيبون يكدحون في أعمالهم. فلما أراك تسخر منهم فاعتبرت وجه أبي الثرية ابتسامة عريضة، وقال السيدة مارتن بمثابة أم لي. ولم أكن لأبلغ هذا المبلغ من القسوة معها. وقد أبدو قاسيا لأني أبذل قصارى جهدي في الإفصاح عن حقيقة شيء ما لكما. فمقصدي هو إكساب نطركما رحابة تمكنك ما من رؤية الأشياء. أشياء لم ينتفع أكثر الناس لرؤيتها لضيق نظرتهم. فأكثر الناس لا يرون الشرك الذي هم عالقون به. جلست أنا ومايك هناك متحيرين من مغزى ما يقوله. ولقد بدا قاسيا فيما استشعرنا استماتته في تعريفنا بشيء ما قال مبتسما : ألا تبدو الخمسة وال20 سنتا في الساعة شيئا حسنا؟، ألا تجعل قلبيكما يدقان بصورة أسرع؟ هززت رأسي بالنفس رغم أن قلبي كان يدق بصورة متسارعة منفعلة. فقد مثلت السنتات الخمسة وال20 مقابلا كبيرا بالنسبة لي. فقال وعلى وجهه ابتسامة   ماكرة. حسنا سأدفع لكما دولارا لقاء الساعة بدل أنا قلبي تتسارع أكثر من دقاته. فيما كان عقلي يصرخ قائلا لي أن أقبل بالعرض  ولم أستطع تصديق ما كنت أسمع، فلم أزل صامتا. قال حسنا فلنجعله دولارين لقاء الساعة.
يا سلام..
أوشك عقلي وقلبي اللذان في التاسعة من العمر أن ينفجر. ففي كل حال كنا في عام 1956 وكان تقاضينا لدولارين في الساعة لا يجعل منا أثرى طفلين في العالم. ولم يكن باستطاعته تخيل كسب هذا المقدار من المال. فأردت أن أقول نعم، وأردت قبول العرض. لقد صار بوسع تخيل دراجة جديدة وقفازين جديدين للعبة البيسبول واحترام أصدقائي حين ألوح ببعض المال. وفق هذا وذاك لن يصير بمقدور جميع ولا أصدقائه أن يلقب ان بالفقير ثانية. لكن، لكنه فم يبقي مطبقا. ربما التهب عقله وتفجر، لكني رغبت في أعماقه وبشدة في دولارين مقابل الساعة. كانت المثلجات قد ذهبت وسالت فوق يدي وصارت عصا المثلجات الفارغة فيما كان النمل يستمتع في الأسفل بوفر الشيكولاتة والفانيليا الذائب تين. كان أبي ثرية، ينظر إلى فتيين يحدقان هم أيضا إليه بأعين مفتوحة و عقلين قويين. لأنه يعرف اختباره لنا كما كان يعرف أن جزء من مشاعرنا أرادنا أن نقبل بالعرض. كان يعرف أن كل إنسان لديه جزء من روحه يعاني الضعف والافتقار ويمكن شرائه. لقد طرح علينا سؤالا استعصى على الناس التغلب على إغراءه. ولا طالما امتحن أبي الثري آلافا من الأرواح في حياته. يمتحنو ها في كل مرة يجري مقابلة مع شخص ما يطلب وظيفة قال حسنا، لنجعلها 5 دولارات في الساعة فجأة دخلني الصمت. لقد تغير شيء ما، لقد كان العرض سفيا للغاية ومضحكا إذ ليس هناك كثرة من البالغين في عام 56 يجنون أكثر من 5 دولارات لقاء الساعة. ولقد زال الإغراء وحل محله الهدوء. والتفت ببطء إلى يساري لأنظر إلى مايك. ف. بادلني النظر. كان الجزء الضعيف والمفتقر في روح صامتة، فيما نشط الشطر غير القابل للبيع. لقد غمر عقلي وقلبي هدوء ويقين إزاء المال. وعرفت أن مايك قد استشعر الحالة ذاتها. قال أبي الثري بنعومة. هذا شيء طيب فل أغلب الناس ثمن. ويأتي هذا الثمن جراء الغرائز الإنسانية المسماة الخوف والجشع. إذا الخوف من قلة المال هو ما يحفزنا على الكبد. وثورة تلقينها للمقابل يشرع الجشع أو الرغبات في تصوير جميع الأشياء الرائعة التي يستطيع المال شراءها وساعتها يصبح ذلك هو نمط حياة الناس. فسألته أي نمط تقصد؟ قال نمط الاستيقاظ هو الذهاب للعمل وتسديد الفواتير، ثم الاستيقاظ والذهاب إلى العمل وتسديد الفواتير. فتجري حيواتهم عندها طبقا ل غريزتي ن الخوف والجشع. اعرض عليهم المزيد من المال وس يدورون في نفس الدوائر إذ يزيد إنفاقهم وهذا ما أطلق عليه سباق الفئران. فسأله مايك، أثمة سبيل آخر؟ فقال بيتأذى نعم. وقلة من الناس تعرفه تساءل مايك ثانية، ومع هذا السبيل. فقال إنه ما آمنوا أن تجد اه أيها الولدان بعلمكم او دراستكم ما معي.
حلو.
ولهذا قد استبعدت جميع صور المقابل المادي. فسأله مايك أفلا تعطينا لمحة عنه فلقد داخلنا السائق م من العمل الشاق يو خاصة بلا مقابل. قال أبي الثري حسنا الخطوة الأولى هي قول الحقيقة. فقلت ولكننا لم نكذب فرد علي أبي ثري لم أقل إنكما كنتما تكذبان، لكنني طالبتكم ما بقول الحقيقة فسألته الحقيقة عن ماذا؟ فقال عما تشعران به، وليس عليك أن تخبر به أحدا ما، فقط ذاتك وسألته هل تقصد أن من في هذه الحقيقة والذين يعملون عندك والسيدة مارتن لا يفعلون ذلك؟ فقال. أشك في أنهم يفعلون ذلك. إذا بدلا من هذا يعتريهم الخوف من افتقاد المال وبدلا من مواجهة الخوف. يلجأون إلى ردود الأفعال للتفكير. فيأتي رد فعلهم عاطفيا بدلا من استخدام عقولهم. ولا ذلك، وهو يربط برفق على رأسينا ثم استطرد يقول وعندها يجنون قلة من المال في أيديهم وثانية تنشط مشاعر الفرح والرغبة والجشع. ثم يلجأون مرة أخرى إلى رد الفعل بدلا من التفكير. فقال مايك فتقوم مشاعرهم إذا مقام تفكيرهم. فقال أبي ثري الشط فبدلا من قولهم الحقيقة عما يشعرون به يلجأون لرد الفعل تجاه هذا الشعور ويفشلون في التفكير إذ يعتريهم هذا الفوص القديم. في دفعهم للذهاب إلى العمل آمنين أن يطرد المال خوفهم لكنه لا يفعل ف يرتاده مخوفهم القديم سيعودون للعمل آمرين أن يهدئ المال من مخاوفهم ومرة أخرى لا يفعل هذا. في قيم الخوف عالقين في شراك العمل وجني المال ثم العمل ثم جني المال. آملين أن يذهب فوق.
يكون.
لكن هذا الخوف يستيقظ معهم في كل مرة يستيقظون فيها. كما يبقي هذا الخوف القديم الملايين من الناس أيقاظا طوال الليل جعل الليل هم قلقا مضطربا. لا يستيقظون ويذهبون إلى العمل آملين أن يقتل شكل قبض هذا الفوص الذي يأكل أرواحهم، وهكذا يسوق المال حياتهم ولكنهم يرفضون الاعتراف بهذه الحقيقة، فالمال يهيمن على أحاسيسهم وبالتالي على أرواحهم. ثم جلس أبي الثري هادئا تاركا لكلماته أن تتغلغل فينا. ولقد سمعت أنا وما يتم قاله، لكننا لم نستوعب بالكلية ما كان يتحدث عنه. أعرف أني طالما تساءلت عن سببه روع البالغين إلى أعمالهم. فيما لا يبدو في الأمر الكثير من المرح بالنسبة لهم، وأنهم لم يبدوا سعداء أبدا، ورغم ذلك أبقاهم شيء ما مقبلين بشدة على العمل. وقال مدركا أننا استوعبنا قدر استطاعتنا ما تحدث عنه. أريدكما أيها الولدان أن تتجنب الوقوع في هذا الشرك. فهذا ما أبغي حقيقة تعليمكم إياه، وليس فقط بلوغ كم الثراء فبلوغ الثراء لن يحل المشكلة. فسألته مندهشا ألا يحل المشكلة؟ فأجابني لا لا يحل المشكلة والت، دعني أنجز حديثي عن العاطفة الأخرى وهي الرغبة، البعض يسميها جشع لكني أفضل أن أسميه الرب. إنه من الطبيعي للغاية أن يرغب المرء في شيء أفضل وأجمل، وأكثر متعة وإثارة. ولهذا يعمل الناس لجني المال انطلاقا من الرغبة. إذا يرغبون في المال لما يظنون أن له قدرة على شراء السعادة؟ لكن السعادة التي يجنيها المال غالبا ما تكون قصيرة، وسرعان ما يحتاجون للمزيد من المال لتحصيل المزيد من السعادة والبهجة والراحة والأمان. في عمل ونظامين أن المال سيسكن أرواحهم المهتاجة بالخوف والرغبة. لكن المال لا يمنحهم ذلك. فسأله مايك ولا الأثرياء منهم. فأجاب عبيد ثري ولا الأثرياء منهم، ففي الحقيقة لم يسعى الكثير من الأثرياء إلى الثراء بسبب الرغبة، بل بسبب الخوف. إذ يحسبون المال قادرا على تخليصهم من خشية الافتقار إلى المال، ومن الفقه ف يكدسون الأطنان منه فقط يجد أن خوفهم صار أسوأ. إذ هم الآن لا يخشون فقدان ة. وإن لي أصدقاء يكدون في تحصيله رغم وفرة ما جمعوه منه. وإني لأعرف أناسا جمعوا الملايين ويعتريهم اليوم خوفا يفوق ما كان يعتريهم أيام عوزهم. يمتلكهم والهلع من فقدانه جميعا. فبلغ بهم ص وفهم الذي صار بهم إلى الثراء مبلغ السوء. وتعاظم صراخ وذلك الشطر المعوذ والواهن من أرواحهم فلا يرغبون في فقدان منازلهم الرحبة ولا سياراتهم، ولا مستوى المعيشة الرفيع الذي أتاحه المال. فهم. في قلقون على ما سيقوله أصدقائهم، إنهم فقدوا ما لهم جميعا، فيمتلك العديد منهم اليأس والعصاب رغم ما عليهم من إمارات الثراء وما يملكونه من وفير المال. فطرحت عليه السؤال أن يكون الرجل الفقير أسعد إذا فأجابني قائلا لا لست أظن ذلك. فعدم الرغبة في المال لا تقل في شذوذها عن الهوس به. وكما لو جلسنا على رؤوسنا الطيب، تجاوز أحد المشردين الطاولة التي نجلس إليها. وتوقف عند صندوق يممه وأخذ يعبث به. جلست ثلاثتنا ننظر إليه بانتباه عظيم فيما كنا نتجاهله قبل هذا التقط أبي الثري دولارا من حافظة نقوده. ولوح به للرجل العجوز. وفور رؤيته للمال هرور الرجل المشرد تجاهنا سريعا ليأخذه، وقدم وافر الشكر لأبي الثري. في النهار ولا منتشيا بثروته الكبيرة. اللاعب الثري ليس مختلفا كثيرا عن أغلب الموظفين. لقد قابلت الكثير من الناس الذين يقولون ربي إنني لست آبه بالمال لكنهم يعملون في الوظيفة لمدة 8 ساعات في اليوم. وذاك إنكار للحقيقة، فإن لم يكونوا آبهين بالمال، فلما يعملون إذا إن هذا النوع من التفكير لا هو أكثر شذوذا من تفكير الشخص الذي يختزن المال. وإذا جلست هناك مصريا لأبي ثري كنت أسترجع بعقلي مرات لا تحصى، قال فيها أبي الفقير أنا لست آبها للمال. كان كثيرا ما يكرر تلك الكلمات كما كان يصف نفسه دوما بقوله أعمل لأني أحب عملي. فطرحت على أبي الثري السؤال، فما العمل إذن أن أبقى بالعمل حتى تنصرف عمل المخاوف والجشع؟ فأعجبني قائلا لا، فذاك مضيعة للوقت فالعاطفة هي ما يجعل منا بشرا ويجعل منا شيئا حقيقيا. فالعاطفة كلمة تعني طاقة وحركة. فكون صادقين عما تشعران به. ووجه عقل هي كما و عواطفكم الصالح كما وليس ضد، كما قال مايك مهلا، بالله عليك فقال لاعبي الثري. لا تقلق مما قلت أن فا فس تدركه إدراكا أعمق كلما مرت بكس نوم. عليك الملاحظة وحسب، ولا تستجب لعواطفك فأغلب الناس لا يعرفون أن ما يقوم بالتفكير عنهم إنما هي عاطفتهم. والعاطفة تبقى عاطفة، ولكن عليك تعلم كيف تفكر.
طيب.
فسألته هل يمكن أن تضرب لنا مثلا على ما تقول؟ فقال بالطبع عندما يقول شخص ما إنني في حاجة لأجد وظيفة. من الرجح أن عاطفته هي ما تقوم بالتفكير له. إذا الخوف من الفقر هو ما يولد هذه الأفكار. فقلت، لكن الناس يحتاجون المال حقا إن توجب عليهم سداد الفواتير فأجاب مبتسما بالطبع نعم. ولكن كل ما أقوله هو أن الخوف هو ما يقوم بالتفكير على الدوام. قال مايك. لا أفهم. فقال على سبيل المثال اعترى المرأة خوف من الفقر بدلا من المسارعة بالحصول على وظيفة لجني بضعة دولارات يقتل بها خلصه. يسأل نفسه السؤال التالي. هل هي الوظيفة هي الحل الأفضل لتجنب هذا الخوف على المدى الطويل؟ في رأيي ستكون الإجابة بلا وخاصة بعد أن ننظر كل حياة المرء كاملة. إذا الوظيفة مجرد حل قصير الأجل لمشكلة طويلة الأجل. فقلت متحيرا، لكن أبي يقول دوما لي ابقى بالمدرسة ون لدرجات حسنة حتى تجد وظيفة آمنة مستقرة. قال أبي ثري مبتسما نعم وأفهم لما قال هذا. فأغلب الناس يزدون هذا الأمر انطلاقا من الخوف. فطرحت عليه سؤال أتقول إن أبي يقول هذا بدافع الخوف؟ أجابني قائلا نعم. فهو يخشى أن لا تكون قادرا على جني المال وأن لا ترتقي بوضعك في مجتمعك، فلا تسيء فهمي. إنه يحبك ويرغب لك في الأفضل، وإنني لا أحس بأن خوفه هذا مبرر. ف حصولك على التعليم والوظيفة. لا هو شيء
مهم.
لكن ذلك لن يحل عقدة الخوف. وانظر إن الخوف ذاته الذي يقظه في الصباح الإ يجني قلة من الدولارات. هو الخوف الذي يجعله متمسكا بذهابك إلى المدرسة. فسألته فما الذي تراه أنت إذا؟ قال أريد أن أعلمكم التحكم في قوة المال لا أن تخشي منها وهم لا يعلمون كما هذا في المدرسة، ولكن كما إن لم تتعلم هذا ستصير ان عبدين للمال وأخيرا بدأ كلامه منطقيا فقد أرادنا أن نوسع من رؤيتنا وأن نرى ما لم تستطع السيدة مارتن رؤيته، ولم يكن بوسع موظفيه أن يروه وما لم يفهمه أبي عن هذا الأمر. لقد ضرب أمثلة بدت صعبة في هذا الوقت، لكنني لم أنساها أبدا. فلقد اكتسبت رؤيتي رحابة في ذلك اليوم وصار بإمكانه رؤية الشرك الذي يوشك أغلب الناس أن يعلق فيه. قال أبي ثري انظر كلنا يعمل في نهاية الأمريكان موظف لكننا نعمل بمقادير مختلفة. وأريد لكما أيها الولدان أن تنال فرصة المعافاة من الوقوع في الشرك. هذا الشرك الذي تتسبب فيه هاتان ال عاطفتان الخوف والرغبة هل تستخدمها لصالحك مع؟ فهذا ما أبغي تعليمكم إياه فلست أرغب في أن أعلمك ما فقط لقاء قلة من ال فلن يعالج هذا الخوف أو الرغبة وإن لم ت تغلبها على الخوف والرغبة أولا وصرت ما إلى الثراء فلن تعدوا أن تكون عبدين يجنيان وفي رمال. فسألته فكيف لنا إذا أن نتلافى الوقوع بالشراكة؟ قال إن السبب الرئيسي وراء الفقر أو المعاناة المالية هو الخوف والجهل وليس للاقتصاد أو الحكومة أو الأثرياء. إن الخوف هو الذي يبقي الناس عالقين بالشراكة. فلكم أيها الولدان أن تذهب إلى المدرسة ثم تنال درجة تيكم الجامعية وأنا سأعلمكما تلاف لوقوعي بالشراكة. بدأت خيوط الصورة مشوشة، تتجمع معنا، فلقد نال أبي صاحب التعليم العالي تعليما عظيما و وظيفة عظيمة. لكن المدرسة لم تعلمه قبط التعامل مع المال أو التغلب على خوفه. وبدأ من الواضح لي أن بوسع تعلم أشياء مهمة ومختلفة من كلا الأبوين. وسائلهم مايك وهكذا ظللت تتحدث عن الخوف من الفقر، فكيف تؤثر إذن الرغبة في المال على تفكيرنا؟ قال. كيف شعرت ما عندما أغريتك ما بزيادة ما تتقاضيان؟ هل شعرت ما بالرغبة تثير فيك ما فأومأ ناب رأسينا. تابع قائلا. بامتناع كما عن الاستسلام للعاطفة، كنتما قادرين على التفكير وتجنب رد الفعل، وهذا هو الشيء الأهم. فلسوف تعتبرين مشاعر الخوف والجشع على الدوام، لكن من الآن فصاعدا سيكون الشيء الأهم لك معه وتوظيف هاتين العاطفتين لصالحكم اول خير كما طويل المدى لا أن تدع العاطفة توجه كما ببساطة بأن تهيمن على تفكيرك ما إن أغلب الناس يوظفون الخوف والجشع ضد صالحهم. وذاك هو أول الجهل. ينفق أغلب الناس حيواتهم في الركض وراء شك القبض والعلاوات والأمان الوظيفي انطلاقا من عاطفتي الخوف والرغبة، وليس انطلاقا من فهم إلى أين يقودهم التفكير الذي تهيمن عليه هاتان ال عاطف.
تم يشبهون في ذلك الحمار الذي يجر العربة، فيما يمد صاحبه بقطعة الجزر قبالة أنفه. فقد يصل صاحب الحمار إلى المكان الذي يريد الذهاب إليه، فيما يتبع الحمار السراب، ولن يكون في الغد سوى جزرة أخرى للحمار. فسأله مايك. أتعني أنني حين أشرع في تصور قفازين جديدين لكرة البيسبول وحلوى وألعاب تكون هذه الأشياء ليك الجزرة بالنسبة إلى الحمار؟ فقال مبتسما نعم وكلما مضى بك العمر تكبدت ثمنا أكبر لقاء ألعابك. تلك الألعاب التي تصير سيارة جديدة وقاربا ومنزلا تاريا تتباهى به بين أصدقائك. ثم تابع قائلا فالخوف يدفعك خارج مك منك فيما تناديك. الرغبة مغرية إياك لتقذف بك على الصفر. وذاك هو الشراك. فسأله مايك فما هي الإجابة إذن؟ قال إن الجهل هو ما يعظم من تأثير الخوف والرغبة، ولهذا يتعظم خوف الميسورين كلما تعاظم ثرائهم. فالمال هو الجزرة هو الوهمي. وإن لم يسعى الحمار أن يتبصر بالصورة كاملة، فقد يقرر ثانية أن يطارد الجزرة. ومضى بالثري ومبينا أن الحياة الإنسانية إنما هي صراع بين الوهم والجهل، وبين كيف أن الإنسان ثورة توقفه عن تحصيل المعرفة وجمع المعلومات عن ذاته. يقع في الجهل. وهذا الصراع الذي يمتد من لحظة لأخرى إنما هو حول اتخاذ قرار إما بفتح المرء عينيه أو إغلاقهما. قال أبي ثري اسمع إن المدرسة مهمة للغاية، فلتذهب إلى المدرسة لتتعلم مهارة أو عملا حتى تكون فردين مساهمين في مجتمعك ما. فما من ثقافة إلا وتحتاج إلى المعلمين والأطباء والفنيين و الفنانين والطهاة ورجال الأعمال ورجال الشرطة ورجال الإطفاء والجند والمدرسة هي التي تعلمهم ماذا؟ من أجل أن يحقق مجتمعنا الازدهار والنمو. لكن ما يؤسف له هو أن المدرسة صارت هي نهاية المطاف للعديد من الناس وليست البداية. سادة صمت طويل في مكان قديم مبتسما. ولم أستوعب كل ما قاله هذا اليوم. لكن الحالة كما هي مع المعلمين العظام، والذين تبقى كلمتهم لتعلمنا سنوات حتى بعد رحيلهم بوقت طويل. لا تزال كلماتهم تتردد في مسامع إلى اليوم. في المقال. لقد أثقلت عليكم اليوم قليلا، لكنني أثقلت لسبب وهو أنني رغبت في أن يبقى هذا الحديث أبدا في ذاكرتي، كما أريدكما دوما أنت فكرها في الحمار وألا تنسيها مثله أبدا حيث بإمكانه عاطفتي الخوف والرغبة في، كما أن توقع كما في أخبث شراك الحياة إن لم تعيه ما قبل أن يهيمن اعلى تفكيرك ما فمن البلاء أن تنفقها حياتكما خائفين، فلا تسعيان لتحقيق أحلامك ما أبدا، كما أنه من البلاء أنت كدح لقاء مال ظانين أن ذاك المال سيبتاع لكم أشياء تجلب ولكم السعادة. فالاستيقاظ في جوف الليل فزعا من سداد الديون لا هو أسلوب مروع للعيش. وحياة تعيشانها طبقا لما يمليه عليك ماشي بالقبض، ما هي بحياة؟ وفي ظني أن الوظيفة ستجلب لكم الشعور بالأمان كذب على نفسيكما فذاك العمر البلاء. وهذا هو الشراكة الذي أحذركم ا من الوقوع فيه إن أمكن لكم ذلك. فلطالما رأيتما كيف يوجه المال حياة الناس فلا تدع ذلك يخضع كما ولا تدع المال يسيطر على حياتك ما قفزت إحدى الكرات أسفل طاولتنا فالتقطها أبي الثري وقذفها إلى أصحابها. فسألته فما هي العلاقة إذا بين الخوف والجشع، وبين الجهل قال الجهل بطبيعة المال هو ما يولد فينا هذا المقدار من الخوف والجشع، ودعني أضرب لكم بعض الأمثلة. إليكما مثل الطبيب الذي يرغب في المزيد من المال ليوسع على عائلته، فيزيد من المقابل الذي يتقاضاه. وبزيادة هذا المقابل، يجعل من الرعاية الطبية شيئا مكلفا أكثر على الجميع. وها هو الآن يؤذي أكثر ما يؤذي الفقراء. فتسوء حالتهم الصحية وتتدنى عن حالة الميسورين. ولأن الأطباء قد زادوا مما يتقاضونه، فإن المحامين يحذون حذوهم. وإذا زاد أولئك من المقابل الذي يتقاضون يرغب المعلمون في المثل مما يزيد من الضرائب المفروضة علينا، وهكذا دواليك. وسريعا ستظهر تلك الفجوة الفاحشة بين الأغنياء والفقراء، فتشيع تلك الفوضى وتنهار حضارة أخرى عظيمة. فلقد انهارت الحضارات العظيمة عندما أضحت الفجوة بين المغفورين والمعوزين واسعة. وإن أمريكا لا تسير في الدرب ذاته، مؤكدة للمرة الثانية أن التاريخ يعيد نفسه. لأننا لا نتعلم من تاريخنا، فنحن نتذكر التواريخ والأسماء، لكننا لا نتذكر دروس التاريخ فسألته أليس من الطبيعي أن ترتفع الأسعار؟ أجابني قائلا. ليس في مجتمع متعلم تديره حكومة تحسن إدارة الأمور وحقيقة ليس فرضا على الأسعار أن تنخفض رغم أن هذا بالطبع هو الصواب نظريا. وإنما ترتفع الأسعار بسبب الجشع والخوف الذين يجلبهم الجهل. فإن علمت المدارس الناس طبيعة المال، لكن هناك مال أكثر وأسعار أقل، لكن المدارس لا تركز سوى على تعليم الناس كيف يعملون لجني المال وليس لي ملك زمام. فتساءل مايك ولكن أليست لدينا كليات للأعمال ألا تشجعني على الالتحاق بكلية من كليات الأعمال لأحصل على شهادة الماجستير منها؟ أجاب أبي ثري. نعم، كليات الأعمال في جميع الأحوال لا تخرج سوى الموظفين ال شحيحين والمعقدين فكل ما يتقنونه هو الأرقام وفصل الناس وتدمير العمل. وإنني لأعلم هذا لأنني قد وظفت أناسا منهم. فكل ما يستحوذ على تفكيرهم هو اقتطاع التكاليف ورفع الأسعار، وهو ما يخلق المزيد من المشاكل. هو صحيح أن وجود هذا النوع من الناس المهم وأتمنى أن يتعلم المزيد من الناس صنعتهم، لكن ما يقومون به ليس كل شيء. قالها أبي بغضب، فأعاد مايك السؤال. هناك إجابة إذا قال أبي الثري نعم تعلم كيف توظف عواطفك في التفكير وألا تفكر بعواطفك وعندما تسيطران أيها الولدان على عواطفك ما بأن توافق أولا على العمل بها مقابل. يخالجني الشعور بأن هناك أمل، وعندما قاومت ما ثانية عاطفتك ما أغريتك ما بالمزيد من المال. كنت مع ثانية تتعلمان أن تفكر بدلا من أن تستجيب للعاطفة، وتلك هي الخطوة الأولى. فسألته؟ ولما تعد هذه الخطوة الأولى مهمة. أجابني. حسنا، إن اكتشاف هذا موكل إليك مع فإن أردت ما أيها الولدان أن تتعلم فسوف أصعب كما إلى الدغل، ذلك المكان الذي يتلاف. اه أغلب الناس. فسوف أفرضكم ال هذا المكان الذي يخشاه أغلب الناس، فإذا أتيت ما معي فس تتخليان عن فكرة العمل لقاء المال وستتعلم ان بدلا منها جعل المال يعمل لصالحك ما فسألته فماذا سنجني إن أتينا معك؟ ماذا لو وافقنا أن نتعلم منك ماذا سنكسب جراء هذا الجانب؟ ذلك ما جناه الأرنب العشبي التحرر من الرغبة الطفولية. فسألته؟ وهل هناك دغل؟ أجابني نعم الدغل وهو الخوف والجشع فينا والمخرج من هذا الدخل هو مواجهة خوفنا وجشعنا و ضعفنا وافتقارنا، وسبيل لهذا يكمن في العقل باختيار أفكارنا. فسأله مايك متحيرا باختيار أفكارنا. فأجاب نعم باختيار ما نفكر فيه بدلا من رد الفعل على مشاعرنا. ذكر بدلا من مجرد الاستيقاظ والذهاب للعمل لحل مشاكلك لا لشيء انطلاقا من خوفك من قلة المال الذي تريد أن تسدد به فواتيرنا. إي سيستغرق التفكير وقت ال يطرح عليك سؤالا سؤالا يشبه هل بذل أقصى الجهد في هذا هو أفضل حل لهذه المشكلة. إن أغلب الناس يهلعون من عدم مصارحة أنفسهم بأن هذا الخوف هو المهيمن عليهم. وأنه ليس بوسعهم التفكير، وبدلا من المواجهة يهرعون خارجين من الباب. وها هنا تسيطر عليهم الرغبة الطفولية، وهذا ما عنيته باختيار المرء لأفكاره. فسأله مايك، فكيف لنا أن نفعل هذا؟ فقال هذا ما سأل قيم كما إياه سأعلمكما أن يكون لكم الخيار على أفكاركما بدلا من رد الفعل الخانع.
فتح.
كذلك المتمثل في ازدراد قهوة صباحكما والهرولة خارج الدار. ولتذكر ما قلته سابقا، الوظيفة تحل قصير الأمد لمشكلة طويلة الأمد وأغلب الناس لا يفكرون سوى في مشكلة واحدة وقصر أمدها. إنها مشكلة الفواتير واجبة السداد في نهاية الشهر. إنها الرغبة الطفولية. فساعتها يسيطر المال على حيواتهم. أو هل يتوجب علي أن أقول إن الخوف والجهل بطبيعة المال هما ما يفعلان ذلك؟ وهم في هذا يتأسون بآبائهم بالاستيقاظ يوميا والذهاب إلى العمل لتحصيل المال وفي عدم توافر الوقت لديهم ليتساءلوا هل هناك من سبيل آخر؟ فمشاعر هم الآن هي التي توجه تفكيرهم وليس رؤوسهم. فسأله مايك، هل يمكنك إخبارنا بالفرق بين تفكير العاطفي والتفكير العقل؟
إي.
فقال أبي ثري نعم فأنا أسمعه طوال الوقت إذا أسمع أشياء مثل في الواقع على كل إنسان أن يعمل أو إن الأثرياء محتالون أو سأحصل على وظيفة أخرى فأنا أستحق علاوة وليس لكم الحق في استغلال أو تعجبني هذه الوظيفة للأمان الذي تتيحه. بدلا من قول، هناك شيء أفتقده هنا. وهو ما يجعل المرأة يفيق من التفكير العاطفي ويمنحك الوقت لتفكر بوضوح. ولا بد أن أعترف بأن هذا كان درسا عظيما تلقيته وهو معرفة متى يتحدث المرء انطلاقا من التفكير العاطفي. ومتى يتحدث انطلاقا من الفكر الواضح؟ وكان درس انتفعت به بقية حياتي. خاصة بعدما كنت شخصا يوجهه رد الفعل، وليس فكره الواضح. وفي طريق عودتنا إلى المتجر شرح أبي الثري كيف أن الأثرياء قد جنوا المال حقها، لكنهم لم يعملوا لأجل كسبه، وشرع يفسر كيف كنت أنا ومايك عندما كنا نغيب العبوات المعدنية ذات السنتات الخمسة ظنين بأننا نجني المال قريبين آنذاك للغاية من الطريقة التي يفكر بها الأثرياء، لكن المشكلة كانت أننا نقوم بذلك بشكل غير قانوني. كان القانون يبيح ذلك للحكومة وللمصارف، وليس لنا. وشرحها كيف أن هناك سبلا لجني المال وسبل القانونية لذلك؟ بين أبي ثري أن الأثرياء يعلمون أن المال وهم مثله في ذلك مثل الجزرة المعلقة أمام الحمار. والخوف والجشع هم اللذان يمكنان من خداع المال في صدور مليارات من الناس الذين يظنون المال حقيقة. فالمال وهم مختلق. وليس ذلك سوى لما يسيطر على جموع الناس من ثقة وجه للرسول في الرمل الواهن. والحق أن جزرة الحمار لا هي أعلى قيمة من المال. ثم تحدث عن معيار الذهب الذي كانت الولايات المتحدة تعمل به، وكيف كان كل دولار ورقي صك فضيا في الحقيقة، وما أثار اهتمامه تلك الشائعة التي تزعم أننا قد نتخلى يوما مع معيار الذهب وكيف لن تصير دولاراتنا عندها صك فضية. قال متابعة ويوم يحدث هذا أيها الولدان فاشلة فتح أبواب الجحيم إذا ستتهاوى حياة المعوزين وأفراد الطبقة الوسطى والجهال أنقاضا ببساطة وذلك لأنهم سيستمرون في الإيمان بأن المال حقيقي، وأن تلك الشركة التي يعملون بها أو الحكومة س ترعاهم. ولم نفهم حقيقة ما كان يقوله ذلك اليوم، لكنه كان حقيقة واقعا كلما مضت عليه السنين.

 """ ,
                    style: TextStyle(
                      fontSize: width,
                      height: 2,
                      color: (clr != false)?  Colors.white :Colors.black,

                    ),



                    textAlign: TextAlign.justify,
                  ),
                ),
                Row(

                  mainAxisAlignment: MainAxisAlignment.spaceAround ,
                  children: [

                    InkWell(

                      child: Container(
                        margin: EdgeInsets.only(top: 120,right: 20),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.cyan,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),
                        child: Icon(
                          Icons.add,
                          color: Colors.black,

                        ),

                      ),
                      onTap: (){
                        width++;
                        setState(() {

                        });
                      },


                    ),

                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 20),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.cyan,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),
                        child: Icon(
                          Icons.remove,
                          color: Colors.black,

                        ),

                      ),
                      onTap: (){
                        width--;
                        setState(() {

                        });
                      },


                    ),

                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 10),
                        height: 40,
                        width: 40,
                        decoration: BoxDecoration(
                          color: Colors.black,
                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],
                        ),

                      ),
                      onTap: (){
                        clr = true;
                        setState(() {

                        });


                      },


                    ),
                    InkWell(
                      child: Container(
                        margin: EdgeInsets.only(top: 120,left: 10),
                        height: 40,
                        width: 40,
                        decoration:
                        BoxDecoration(
                          color: Colors.white,

                          borderRadius: BorderRadius.circular(14),
                          boxShadow: [BoxShadow(
                            color: Colors.grey,
                            spreadRadius: 5,
                            blurRadius: 7,
                            offset: Offset(3, 3),
                          ),],

                        ),



                      ),
                      onTap: (){
                        clr = false;
                        setState(() {

                        });


                      },


                    ),
                  ],
                ),
              ],
            ),



          ],
        ),
      ),
    );
  }
}
