import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class AlmgdmahB extends StatefulWidget {

  const AlmgdmahB({Key? key}) : super(key: key);


  @override

  State<AlmgdmahB> createState() => _AlmgdmahBState();
}

class _AlmgdmahBState extends State<AlmgdmahB> {
  final ScrollController controller = ScrollController();

  bool clr = false;
  double width = 19 ;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor:  (clr == true)?  Colors.black :Colors.white,
      appBar: AppBar(

        title: Text(" ما كنت أبحث عنه بالضبط ",
          style: GoogleFonts.getFont('Almarai'),

        ),

      ),
      body:  SingleChildScrollView(

        child: Column(

            children: [

              Stack(

                children:[ Container(

                  child:  Image(image: AssetImage("images/fady1.png"),

                  ),
                ),
                  Container(
                    margin: EdgeInsets.only(right: 50,top: 40),
                    child:  Text(" ما كنت أبحث عنه بالضبط ",
                      style: TextStyle(
                          color: Colors.black, fontSize: 20),),
                  ),




                  Container(

                    margin: EdgeInsets.only(top: 250, bottom: 30),
                    padding: EdgeInsets.symmetric( horizontal: 20),
                    child: Text(
                      """  
 لقد تأثر زوجي مايكل باللعبة التعليمية التي ابتكرها روبرت كيزاكي والتي أطلق عليها التدفق النقدي أو كاش فلوس. وقد رتب كيزاكي لكلينا خوض الاختبار التمهيدي فيه. ولكون هذا البرنامج لعبة تعليمية فقد سألت ابنتي البالغة 19 عاما والتي كانت لا تزال طالبة جديدة على إحدى الكليات المحلية ما إذا كانت ترغب في المشاركة ووافقت. وقد شارك في هذا الاختبار أو هذه اللعبة 15 شخصا جرى تقسيمهم لثلاث مجموعات. وكان مايك محقا، فقد كان هذا البرنامج عبارة عن لعبة في شكلها أشبه بمصيدة ملونة بفأر عملاق في وسطها. وعلى خلاف المصيدة كان هناك مضماران أحدهما بداخل والآخر بالخارج وكان الهدف من اللعبة هو الخروج من المضمار الداخلي. وهو ما أسماه  روبرت بمسار الفقر والولوج إلى المضمار الخارجي أو المضمار السريع. وكان روبرت يرى أن هذا المضمار سريعة يمثل سلوك الأغنياء أو الطريقة التي يلعبون بها في الحياة الواقعية. ثم قام روبرت عندها بتعريفنا ما الذي يعنيه بمسار الفأر هذا؟ قال إذا نظرتم إلى حياة من نالوا تعليم ا عادي او يعملون بكد لرأيت مضمار مشابهة. إذ يولد الطفل ويذهب للمدرسة وتعتري الوالدين، الفخورين الإثارة لتفوق طفلهما، وحصوله على درجات كبيرة، ثم قبوله في الجامعة، وقد يلتحق بدراسة للمتخرجين ومن ثم يسلك طريقا حسب الخطة المرسومة. يبحث عن وظيفة أو عن مجال عمل آمن مستقر ويجد تلك الوظيفة ويكون طبيبا ربما أو محاميا أو قد ينضم للجيش أو يعمل بالحكومة. وعامة ما يشرع هذا الشخص في جني المال. ويبدأ حال بطاقته الاعتمادية في الفوضى ويبدأ التسوق هذا إن لم يكن قد بدأ بالفعل. وبتوافر المالي بين يديه يبدأ هذا الشخص في التردد على الأماكن التي يتردد عليها أقرانه ليلتقوا بأناس وليتواعدوا معهم. وبعد ذلك يبحث عن الاستقرار ويتزوج. لقد أضحت الحياة رائعة الآن، إذ اليوم يعمل كل من الرجل والمرأة ويبدأ الدخل في الازدياد، وعندها يشعران بأنهما قد حقق النجاح أو أن مستقبلهما ما قد صار لامعاً. فيقرران ابتياع  منزل وسيارة وتليفزيون ويقومان بإجازة و ينجبان أطفالا. لقد أضحى صندوق السعادة في المتناول والحاجة إلى المال لا تنتهي. ويقرر الزوجان سعيدان أن عملهما إنما غاية في الأهمية، ويشرعان في الكد ساعيين وراء الترقي وعلاوات الأجر. وتأتي الزيادة في الأجر. ويأتي معها طفل آخر، وتظهر الحاجة لمنزل أرحب. فيعملان بكد أكثر لي ضحيا موظفين أكثر كفاءة ويكرس ان المزيد من وقته ما للعمل فيعودان للدراسة لينالا المهارات أكثر تخصصا مما يخولهما جني المزيد من المال وربما يلتحقان بوظيفة إضافياً فيتضخم دخلهما فيما يحدث الشيء نفسه مع وعائهم الضريبي وكذلك ضرائبهم العقارية عن منزلهم الجديد الأرحب وكذلك ضرائبهم المدفوعة عن أمانها الاجتماعي وسائر ضرائبهم الأخرى فيمسكان ببيان دخلهم و يتساءلان أين يذهب المال. ثم يبداّن في استخدامه بطاقتي هم الائتمانية لشراء احتياجاتهم. ويبلغ أطفالهما سن الخامسة أو السادسة، وتتزايد الحاجة لادخار ما يلزم للجامعة، كما تتزايد الحاجة للادخار من أجل تقاعدهما. لقد علق هذان الزوجان البالغان الخامسة وال30 من العمر في مصيدة مسار الفأر لبقية أيام عملهما إذا صار يعملان في شركتهما أو في الحكومة ليسدد ضرائب هما و ليسدد قرض البنك وحساب بطاقات الائتمان. ثم يقومان بنصح أطفالهما بإجتهاد في الدراسة ونيل درجات مرتفعة والحصول على وظيفة آمنة ومستقرة، فلا يتعلم أولئك الأطفال شيئا عن المال سواء من أولئك الذين يتربحون من وراء سذاجتهم ويعملون بكد طوال حياتهم لحساب الآخرين.
وتتكرر العملية في جيل آخر يعمل بكد. وذاك هو مسار الفأر. وسبيل الأوحد للهروب من مسار الفأر هو احترافك  لكل من المحاسبة والاستثمار، وهما المجالات الأكثر صعوبة في الإتقان بسبب الجدال الدائر حولهما. ورغم أن اني محترفة وحاصلة على شهادة في المحاسبة وعملت في ثمان من كبريات شركات المحاسبة  قد فوجئت بالطريقة التي أضفى بها روبرت المتعة والإثارة على تعلم هذين العلمين. فلم نكن نشعر بصعوبة وملل في تعلم المحاسبة والاستثمار ولكنه كان أمرا مثيرا ففيما كنا نعمل جاهدين للهروب من مسار الفأر تناسينا سريعا أننا كنا ندرس. وسريعا تحول اختبار إلى لعبة ممتعة أمارسها مع مجموعة كبيرة من الأفراد في ما بعد الظهيرة. وهكذا أيضا أصبحت مع ابنتي حيث كنا نتحدث عن أشياء لم نناقشها في السابق قط . لقد كانت ممارسة هذه اللعبة تتطلب بيانا بالداخل وقائمة للميزانية. وكانت هذه الأشياء ويسهل علي فهمها. فتسنى لي الوقت كي أساعد ابنتي هي واللاعبين الآخرين على طاولته بشرح المفاهيم التي استعصت على فهمه. فكنت أول المجموعة الوحيدة التي استطاعت الهروب من مسار الفقر في هذا اليوم. لقد استغرق هروب منه 50 دقيقة، على الرغم من أن اللعبة استمرت ل3 ساعات. كان على طاولتي أحد العاملين بمصرف كان هناك لاعب مالك لإحدى الشركات ومبرمج للحاسوب. وما تعجبت له حقا هو ضآلة ما يعرفه هؤلاء الناس عن أي من المحاسبة أو الاستثمار. على الرغم من أنها موضوعات شديدة الأهمية في حياتهم. وتعجبت كيف أداروا شؤونهم المالية في عالم الواقع. لقد كان بوسعي فهم السبب الذي يجعل ابنتي لا تستوعب هذه المسائل، فهي ما زالت في سن صغيرة. ولكن ما استعصى على فهمي هم أولئك البالغون ضعف عمرها على الأقل. إذا كيف لأشخاص في مثل عمرهم ألا يهتموا بتعلم مثل هذه الأمور المهمة؟ وبعد هروبي من مسار الفأر ولساعتين متتاليتين. جلست أراقب ابنتي وهذين شخصين البالغين المتعلمين وذوي النفوذ يلقيان بالنرد ويحركان الطابات. ورغم أنني كنت سعيدة بالمقدار الوافي الذي اكتسباه من المعرفة، إلا أن ما أزعجني هو مقدار جهل البالغين بأساسيات المحاسبة والاستثمار. فقد استوعبا بصعوبة من العلاقة ما بين البيان الداخلي الخاص بهما وبين قائمة الميزانية خاصة بهما، كما استعصى عليهم تذكر كيف أن كل معاملة يمكن أن تؤثر على التدفق النقدي الشهري في كل مرة باع فيها أو اشتريا أصلا من الأصول. وتيقنت من أن هناك  ملايين الأشخاص الذين يعانون ماليا لا لشيء سوى أنهم لم يتعلموا هذه الأشياء، وقلت لنفسي حمد لله  أننا هنا نستمتع ونتلهى وراء رغبتنا. في الفوز باللعبة. وبعد أن أنهى روبرت المسابقة، جلسنا 15 دقيقة للنقاش والنقد فيما بيننا حول لعبة التدفق النقدي. ولم يكن ملك الشركة الجالس على طاولة سعيدا، فلم تعجبه اللعبة فرفع صوته قائلة لست في حاجة لمعرفة هذا، فأنا أوظف المحاسبين والمصرفيين والمحامين ليخبروني عن كل هذا. وهو ما أجاب عنه روبرت قائلا. هل لاحظت من قبل أن هناك الكثير من المحاسبين والمصرفيين والمحامين وسماسرة الأسهم وسماسرة العقارات لم يحقق الثراء؟
إنهم ذوو معرفة وافرة، وهم في الأغلب من الأذكياء، لكن معظمهم لم يحقق الثراء. ولأن مدارسنا لا تعلم الناس ما الذي يفعله الأثرياء. فإننا نلجأ لطلب النصيحة من هؤلاء الناس. وذات يوم تقود سيارتك وتعلق في إشارة مرور وتكافح للإفلات كي تلحق بعملك. فتلتفت إلى يمين لتجد محاسبك عالقا في الشرك المروري نفسه. وتنظر إلى يسارك لترى صرافك، وقد علق مثلك وأرجو أن تفهم مغزى ذلك الأمر. وكان مبرمج الحاسوب هو الآخر لم يستمتع باللعبة. فقال بوسع جراء وبعض البرمجيات التي تعلمني هذا.
وهنا انطلق  لسان المصرفي الذي شعر بإثارة اللعبة قائلاً:
لقد درست هذا في المدرسة بقلم المحاسبة، لكنني لم أعرف كيفية التطبيق على الحياة العملية، أما الآن فأنا أعرف كيف أقوم بذلك. وأحتاج لانتزع نفسي من مسار الفأر.
أما تعليق ابنتي فكان التعليق الذي تأثرت به أكثر من غيره، إذ قالت:
لقد استمتعت بما تعلمت، فلقد تعلمت الكثير عن طبيعة النادي وكيفية استثماره. ثم أضافت قائلة أعرف الآن أن بوسعي اختيار مجال يعمل بأني أحبه لا لما يتمتع به من أمان وبائي ومنافع أول مقدار ما أتقاضاه عنه. فإن تعلمت ما قدمته هذه اللعبة فسأصبح حرة في القيام بما أريد وأن أدرس  ما تمليه علي رغبتي بدلا من تلقي العلم لأن منظمات الأعمال تبحث عن مهارات وظيفية بعينها، فإن تعلمت هذا فلن أقلق على الأمان الوظيفي والأمان الاجتماعي بالصورة التي تشيع بالفعل بين أقراني في الدراسة.
لم تتح لي الفرصة للبقاء والحديث مع روبرت بعد انتهاء اللعبة لكننا اتفقنا على اللقاء لاحقا للمزيد من النقاش حول هذا المشروع. لقد أدركت أنني أرغب في توظيف اللعبة في مساعدة الآخرين ليكتسبوا قدرا أكبر من الذكاء المالي. وقد تشوقت لسماع المزيد من    خططه.
فأعددنا أنا وزوجي لعشاء مع روبيرت وزوجته خلال الأسبوع التالي. ورغم أن ذلك كان لقاء الإجتماعي الأول الذي جمعني به، إلا أنني شعرت كما لو كنا نعرف بعضنا البعض منذ سنوات. لقد وجدنا قواسم مشتركة كثيرة فيما بيننا، وامتد بناء الحديث عن أشياء جمة من الرياضة والعروض المسرحية إلى المطاعم والأمور الاجتماعية ذات طابع اقتصادي. وتحدثنا عن العالم الآخذ في التغير وأمضينا وقتا طويلا في مناقشة كيف لا يدخر الأمريكيون شيئا لتقاعدهم. كما تناقشنا حول حالة الإفلاس التي يمر بها كل من الأمان الاجتماعي والرعاية الطبية. وتساءلنا إن كان الناس يدركون مدى المخاطرة في الاعتماد على خطط المعاشات. كان اهتمام روبرت الرئيسي بالفجوة المتنامية بين ما يمتلكه المرء أو ما لا يمتلكه في أمريكا والعالم من حولنا. وكأحد المغامرين العصاميين والذي علم ذاته بذاته وجاب أقطار العالم يجمع استثماراته، كان روبرت قادرا على التقاعد في سن 47. وقد انصرف عن تقاعده لأنه يشترك معي فيما أهتم به عن أبنائه. إذ يعلم أن العالم قد تغير، لكن التعليم لم يجاري هذا التغير. وطبقا لما يقوله روبرت ينفق الأطفال السنوات من أعمارهم في نظم تعليمية عتيقة دارسين أشياء لن ينتفعوا بها أبدا ومجهزين بها لمواجهة عالم لم يعد موجودة. ويحب روبرت أن يقول إن أخطر نصيحة تعطيها لطفلك اليوم هي أن يذهب للمدرسة وأن يحصل على درجات مرتفعة ويبحث عن وظيفة آمنة مستقرة، فتلك النصيحة عتيقة ومضرة، فإن كان بوسعك أن ترى ما الذي يجري في آسيا وأوروبا وأمريكا اللاتينية لتملكك الاهتمام ذاته الذي يتملكني. ويؤمن روبرت بأنها نصيحة مضرة فيقول لأنك إن رغبت في أن يحقق طفلك المستقبل المالي الآمن، فلن يستطيع اللعب بالقواعد القديمة، فذاك أمر بالغ الخطورة. وسألته ما الذي يعنيه بقوله القواعد القديمة فقال يلعب أناس مثلي طبقا لقواعد تختلف عن قواعدك فما الذي يحدث عندما تعلن منظمة أو شركة ما عن تقليص حجمها؟ قلت يجري تسريح العاملين فيها فتتأذي عوائلهم وتزداد البطالة
قال: نعم. ولكن ما الذي يحدث للشركة وخاصة لو كانت شركة قطاع عام يجري تداول أسهمها في البورصة؟ فقلت: عادة ما يرتفع سعر سهمها عند إعلانها تقليص حجمها. إذ يعجب السوق بشركة التي تدني من تكلفة العمالة فيها سواء عن طريق الميكنة أو بتقليص قوة العمل بصورة عامة. فقال أصبت. وعندما يرتفع سعر السهم. يصبح حملة الأسهم، وأنا واحد منهم أثرياء فذاك ما عنيته بقوله مجموعة مختلفة من القواعد. إذ يخسر الموظفون فيما يربح الملاك والمستثمرون. ولم يكن روبرت يصف الفارق بين الموظف وصاحب العمل فحسب. بل أيضا الفارق ما بين التحكم في قدرك وتسليم مجرياته لشخص آخر. فقلت له: ولكن سبب حدوث هذا يستعصي على فهم أغلب الناس. إذ يرون أن ذلك ليس عدلا. فرد قائلا: ولهذا السبب يعد من الحماقة قولك للطفل تلقى تعليما جيدا. فمن الحماقة استيراد أن التعليم الذي يقدمه النظام المدرسي. سوف يعد طفلك للعالم الحقيقي الذي سيواجهه بعد تخرجه. حيث يحتاج كل طفل للمزيد من التعليم. تعليم ذي صيغة مختلفة كما يحتاجون لمعرفة القواعد. أعني القواعد الجديدة. وتابع قائلة. هناك قواعد خاصة بالمال يلعب طبقا لها الأثرياء. كما أن هناك قواعد أخرى. وهي التي تتبعها نسبة ال95% الأخرى من الناس. إذ يتعلمون تلك القواعد في المنزل وفي المدرسة. ولهذا من الخطورة بمكان أن نقول اليوم لطفل أدرس بجد و ابحث عن عمل. فالطفل اليوم في حاجة لتعليم أكثر تعقيدا. إذا قصر تنظمه الحالية عن تحقيق النتائج المرجوة. ولست أعير اهتماما لأجهزة الحاسوب التي يضعونها في حجرات الدراسة ولا مقدار الأموال التي تنفقها المدارس على العملية التعليمية. فكيف للنظام التعليمي أن يلقن شيئا يجهله؟ إذا كيف للوالد أن يلقن طفله ما لم تلقنه المدرسة؟ وكيف لك أن تعلم الطفل المحاسبة؟ ألن يتملكه الملل؟ وكيف لك أن تدرس الاستثمار وأنت كوالد تنأى بنفسك عن خوض المخاطرة؟ فبدلا من تعليم الأطفال كيفية خوض اللعبة وهما في الجانب الآمن. قررت أنه من الأفضل أن أعلمهم أن يلعبوها بذكاء. فطرحت سؤال على روبرت كيف لك إذن تعليم طفل شيئا عن المال وعن جميع الأمور التي تناولناها بحديثنا وكيف لنا أن نيسر هذه الأمور على الوالدين خاصة ان لم يكونوا مستوعبين لها؟ فقال لي: لقد ألفت كتابا عن هذا الموضوع. فسألته وأين هو؟ فأجابني قائلا: على جهاز الحاسب الخاص بي؟ لقد ظل هناك لسنوات عبارة عن فصول وأجزاء مبعثرة. وكنت أضيف إليه في بعض المناسبات. وإن لم أسعى أبدا لترتيبه وتنسيقه معه. لقد شرعت في كتاباته بعدما حقق كتاب الآخر أعلى مبيعات. لكنني لم أنهي هذا الكتاب الجديد، فلا يزال مبعثرا. إلا أنه بعد قراءته لأقسامها المبعثرة قررت أن الكتابة جدير ويستحق النشر خاصة في هذه الأزمنة المتغيرة، واتفقنا أن أتقاسم أنا وروبرت تأليف هذا الكتاب. طرحت عليه سؤال عن مقدار المعلومات المالية التي يحتاجها طفل فقال إن ذلك اعتمد على طفل نفسه. فبالنسبة له، كان قد علم في بكورته  أنه يرغب في أن يصبح ثريا. وكان محظوظا بأن كان والده ذا شخصية طموحة تسعى إلى ثراء وكان يرغب في إرشاده . يقول روبرت: إن التعليم أساس النجاح. وكما تعد المهارات الدراسية بالغة الأهمية، فإن المهارات المالية ومهارات الاتصال تعد بنفس القدر من الأهمية. وفيما يلي نسرد قصة روبرت عن الوالد الثري والوالد الفقير والتي تشرح المهارات التي اكتسبها عبر حياته. وسيعطي التناقض ما بين الوالدين بعدا مهما للقارئ. لقد قمت بالعمل على كتاب وتحريره وتجميعه وأنا أنصح المحاسبين الذين يقرؤون هذا الكتاب. أن نحو معرفتكم الأكاديمية جانبا، وأفسح عقولكم للنظريات التي يقدمها روبرت في هذا الكتاب. إذا، على الرغم من أن العديد من هذه النظريات يتحدى المبادئ الأساسية المتفقة عليها بصورة عامة في المحاسبة. إلا أنها تتيح بصيرة ثرية عن الطريقة التي يتبعها المستثمرون الحقيقيون في تحليلهم لقراراتهم الاستثمارية. وعندما ننصح   أطفالنا أن يذهبوا للمدرسة وأن يدرسوا باجتهاد وأن يحصلوا على وظيفة جيدة. فإننا نفعل ذلك في أغلب الأحيان اتباعا للعادات الثقافية. فلقد ظل هذا هو التصرف الصائب للقيام به؟ لقد أفزعتني أفكار روبرت عندما التقيته بادئ ذي بدء، فلأنه نشأ في كان في والدين مختلفين تعلم كيف يكافح لتحقيق هدفين مختلفين. إذ نصحه والده المتعلم بأن يعمل في مؤسسة فيما نصحه والده الثري وبأن يمتلك تلك المؤسسة. وفيما تطلب المساران تعليما، تباينت موضوعات الدراسة فيهما تباين تامة تبين ما شجع والد روبرت المتعلم إياه على أن يكون ذكيا. شجعه والده الثري على أن يعرف كيفية توظيف هذا الذكاء. وقد سدد وجود والديه في حياة روبرت العديد من المشاكل. إذا كان والده روبرت الحقيقي موجها بالتعليم في ولاية هاواي، وعندما بلغ روبرت  سن السادسة عشرة من عمره لم يكن ينصحه إلى نصيحة واحدة. إذا لم تحصل على درجات جيدة فلن تجد عملا جيدة. ولكنه روبرت علم أن طريقه هو امتلاك المنظمة وليس العمل فيها. وفي الواقع، لولا النصيحة الحكيمة الملحة من الموجه الإرشادي بالمدرسة العليا ما كان روبرت ليذهب إلى الجامعة. فقد كان متلهفا لتشييد أصوله الخاصة. ولكنه وافق في النهاية على أهمية التعليم الجامعي بالنسبة له. ولأمانة القول قد تكون الأفكار الممثلة في هذا الكتاب شديدة الغرابة والتطرف لأغلب الآباء اليوم. حيث يواجه الآباء مشقة بالغة ليبقوا ببساطة أبنائهم في المدارس. ولكننا كآباء نحتاج في ضوء المتغيرات، أن ننفتح على الأفكار الجديدة والجريئة. بتشجيعك أطفالك على أن يضحوا موظفين فإنك بذلك تشجعهم على سداد القدر الذي يتجاوز الحد العادلة من الضرائب طوال حياتهم. في مقابل وعد بمعاش ضئيل أو في عدم وجود معاش على الإطلاق. كما أنه من الصحيح أن الضرائب تعد النفقة الأثقل على الفرد، ففي الحقيقة تعمل معظم العائلات من يناير وحتى منتصف مايو لصالح الحكومة لا لشيء إلا لتغطية ضرائبهم وبالتالي فنحن بحاجة لأفكار جديدة. وهذا الكتاب يقدم هذه الأفكار. ويرى روبرت أن الأثرياء يعلمون أبنائهم تعليما مختلفا، حيث يعلمون أبنائهم في المنزل، وعندما يجلسون معهم حول مائدة العشاء وقد لا تكون هذه الأفكار هي الأفكار التي تنتقيها لتناقشها وأطفالك، ولكننا نشكرك إذا ألقيت نظرة عليها. وإني لناصحة إياك أن تبقى باحثا، ففي نظر كأم وكشخص حاصل على شهادة معتمدة في مجال المحاسبة، أرى أن مفهوم الحصول على درجات حسنة والعثور على وظيفة جيدة قد صار فكرة قديمة. فنحن في حاجة لتقديم نصيحة أكثر عمقا لأطفالنا. حيث إن أنا أحتاج لأفكار جديدة ولتعليم مختلف، وعسى ألا يكون حثنا لأبنائنا بالكفاح حتى يكونوا موظفين مجدين فيما يسعون حثيثا في الوقت ذاته لامتلاك كيانهم الاستثمارية بالفكرة بالغة السوء. وأملي كأم أن يعين هذا الكتاب الآباء الآخرين وأمل روبرت وتعريف الناس بأن أي فرد قادر على بلوغ الازدهار إن هو اختار هذا . فإن كنت اليوم بستانيا أو سائقا أو حتى متعطلا عن العمل فلديك القدرة على تعليم نفسك وتعليم أولئك الذين تحب لهم أن يرعوا الجانب المالي في أنفسهم. وتذكر أن الذكاء المالية إنما هو العملية العقلية التي من خلالها نحل مشاكلنا المالية. إننا اليوم نواجه عالما وتغيرات تقنية كبيرة مثل تلك التي وجهناها سابقا أو تفوقها، وليس ثمة من يمتلك الكرة السحرية، لكننا متيقنون من شيء وهو أن التغيرات التي ستواجهها  تتجاوز واقعنا، فمن منا يعرف ما الذي سيأتي به المستقبل، ولكن أيا كان الذي سيحدث فلدينا خياران أساسيا أن نلعب اللعبة في الجانب الآمن أو أن نلعبها بذكاء بأن نتجهز ونتعلم ونوقظ ذكائنا  وذكاء أبنائنا المالي. 
-شارون ليشتر - .

 """ ,
                      style: TextStyle(
                        fontSize: width,
                        height: 2,
                        color: (clr != false)?  Colors.white :Colors.black,

                      ),



                      textAlign: TextAlign.justify,
                    ),
                  ),
                  Container(
                    margin: EdgeInsets.only(top: 150, right: 40,left: 40),
                    decoration: BoxDecoration(
                      borderRadius: BorderRadius.all(Radius.circular(20)),
                      color: Colors.black12,
                    ),

                    height: 60,
                    width: 400,
                  ),
                  Row(

                    children: [


                      InkWell(

                        child: Container(
                          margin: EdgeInsets.only(top: 160,right: 60),
                          height: 40,
                          width: 40,
                          decoration: BoxDecoration(
                            color: Colors.cyan,
                            borderRadius: BorderRadius.circular(14),
                            boxShadow: [BoxShadow(
                              color: Colors.grey,
                              spreadRadius: 5,
                              blurRadius: 7,
                              offset: Offset(3, 3),
                            ),],
                          ),
                          child: Icon(
                            Icons.add,
                            color: Colors.black,

                          ),

                        ),
                        onTap: (){
                          width++;
                          setState(() {

                          });
                        },


                      ),


                      InkWell(
                        child: Container(
                          margin: EdgeInsets.only(top: 160,right: 40),
                          height: 40,
                          width: 40,
                          decoration: BoxDecoration(
                            color: Colors.cyan,
                            borderRadius: BorderRadius.circular(14),
                            boxShadow: [BoxShadow(
                              color: Colors.grey,
                              spreadRadius: 5,
                              blurRadius: 7,
                              offset: Offset(3, 3),
                            ),],
                          ),
                          child: Icon(
                            Icons.remove,
                            color: Colors.black,

                          ),

                        ),
                        onTap: (){
                          width--;
                          setState(() {

                          });
                        },


                      ),

                      InkWell(
                        child: Container(
                          margin: EdgeInsets.only(top: 160,right: 108),
                          height: 40,
                          width: 40,
                          decoration: BoxDecoration(
                            color: Colors.black,
                            borderRadius: BorderRadius.circular(14),
                            boxShadow: [BoxShadow(
                              color: Colors.grey,
                              spreadRadius: 5,
                              blurRadius: 7,
                              offset: Offset(3, 3),
                            ),],
                          ),

                        ),
                        onTap: (){
                          clr = true;
                          setState(() {

                          });


                        },


                      ),
                      InkWell(
                        child: Container(
                          margin: EdgeInsets.only(top: 160,right: 50),
                          height: 40,
                          width: 40,
                          decoration:
                          BoxDecoration(
                            color: Colors.white,

                            borderRadius: BorderRadius.circular(14),
                            boxShadow: [BoxShadow(
                              color: Colors.grey,
                              spreadRadius: 5,
                              blurRadius: 7,
                              offset: Offset(3, 3),
                            ),],

                          ),



                        ),
                        onTap: (){
                          clr = false;
                          setState(() {

                          });


                        },


                      ),
                    ],

                  ),



                ],
              )]    ),
      ),
    );
  }
}
